# -*- coding: utf-8 -*-
# @Author : PuYang
# @Time   : 2022/10/21
# @File   : opts.py
import random

def getsomeone(listobject):
    if isinstance(listobject, list):
        someone = random.choice(listobject)
        return someone
    else:
        return None

floor1 = {
    1 : ["打饭"],
    5 : ['户县软面 9元', 'biangbiang面 9元', '老北京炸酱面 9元', '西红柿鸡蛋面 8元', '椒麻鸡拌面 10元', '油泼面 8元', '孜然肉拌面 10元', '二合一拌面 9元', '三合一拌面 13元', '麻辣鸡丝面 9元', '户县哨子面 8元', '岐山哨子面 8元', '酸菜肉丝面 9元', '麻辣汤面 7元', '金汤肥牛面 10元', '鸡丝凉面','麻将凉面'],
    6 : ['纯瘦肉夹馍', '营养菜夹馍', '馄饨', '麻辣(米线、粉条、粉带）', '三鲜(米线、粉条、粉带）', '酸辣(米线、粉条、粉带)', '肉哨子(米线、粉条、粉葡)'],
    8 : ['油泼面 8.0元 7.0元', '烩麻食 8.0元 7.5元', '烩刀削面 8.0元 7.5元', '肉臊子汤面 9.0元 8.0元', '香菇肉丝汤面 9.0元 8.0元', '葱油酸汤面 8.0元 7.5元', '酸菜肉丝汤面 9.0元 8.0元', '精瘦肉干拌面 9.0元 8.0元', '香菇肉丝拌面 9.0元 8.0元', '本營鸡拌面 11元 10.0元', '西红柿鸡蛋面 8.0元 7.5元', '炸酱面 9.0元 8.0元', '肉沫剁椒 9.0元 8.0元', '干拌+炸酱 10.0元 9.0元', '干拌+西红柿 10.0元 9.0元', '干拌+剁椒 10.0元 9.0元', '油泼+西红柿 9.0元 8.5元', '油泼+素臊子 9.0元 8.5元', '油泼+炸酱 10.0元 9.0元', '油泼＋肉臊子 10.0元 9.0元', '油泼+剁椒 10.0元 9.0元', '麻辣饸饹 8.0元'],
    9 : ['面'],
    11 : ['打饭'],
    12 : ['杂粮煎饼豆浆'],
    13 : ['打饭'],
    16 : ['素炒米粉 10元', '鸡肉炒米新 12元', '康炒情粉鲁半 11元', '鸡肉炒續 13元', '鸡肉價粉各半 12元', '土豆片米粉 8元 600克', '竹算米粉', '西兰花米粉 8元 600克', '腐竹米粉 8元 600克', '海带米粉', '杏鲍菇米粉 8元 600克', '金针菇米粉 8元 600克', '莲菜米粉 8元 600克', '广肠米粉', '鸡丝米物', '鱼丸米粉', '鱼豆腐米粉', '肉沫米粉', '牛肉米粉', '肥肠米粉', '鱼块米材', '素炒米粉', '素炒宽粉', '鸡肉炒米粉', '素炒馕粉各半', '素炒馕', '鸡肉炒馕', '鸡肉馕粉各半'],
    17 : ['热米皮6元', '凉米皮 6元', '麻酱凉皮 7元', '潼关肉夹馍肥瘦 7元', '炒米皮 6元', '菜豆腐 4元', '潼关肉夹馍纯瘦 8元', '擀面皮 6元', '红枣粽子 3元', '孜然夹馍 6元', '炒擀面皮 6元', '鸡蛋肠粉', '双蛋肠粉'],
    18 : ['炸鸡薯条可乐'],
    20 : ['油泼面', '精瘦肉油发面 10元', '素燥子油泼面', '剁椒油泼面', '特色凉面', '炸酱油泼面 11元', '西红柿油泼面', '特色原子面', '二合一 10元', '三合一'],
    21 : ['砂锅米线', '砂锅粉带', '砂锅粉条', '砂锅茗皮', '砂锅烩饼', '砂锅龙须面', '砂锅手工面', '砂锅刀削面', '陕北土豆粉砂锅', '砂锅豆腐', '砂锅方便面', '砂锅粉丝', '砂锅鱼豆腐', '砂锅火腿', '砂锅豆腐皮', '砂锅煮馍', '砂锅粗粮面', '砂锅鱼丸', '砂锅金针菇', '砂锅纯菜', '砂锅二合一', '砂锅土豆粉', '砂锅麻食', '砂锅大白宽', '砂锅肥牛', '水煮方便面'],
    22 : ['素菜煮馍 8元', '黄金玉米煮馍 9元', '浓香番茄煮馍 9元', '营养菌菇煮馍 9元', '鱼、虾丸煮馍', '火腿煮馍', '鱼豆腐煮馍', '培粮煮馍 10元', '蟹排煮馍 10元', '开花肠煮馍 10元', '瘦肉片煮馍 10元', '小炒肉丝煮馍 11元', '香辣肉片煮馍 11元', '农家小酥肉煮馍 11元', '秘制肉丸煮馍 11元', '牛肉煮馍 15元', '老坛酸菜鱼 12元', '霸王麻辣鱼 12元', '浓香番茄鱼 12元', '回味椒麻鱼 12元'],
    23 : ['麻辣烫'],
    24 : ['双椒鸡捞面 12元', '双椒鸡捞饭 12元', '双椒烤肠捞面 12元', '双椒牛肉捞面 15元', '双椒虾仁捞面 15元']
}

floor2 = {
    1 : ['招牌燒鸭饭 13元/份', '卤水豆腐饭 8元/份', '爽口肉度饭 10元/份', '潮式五花肉饭 15元/份', '醫油鸡饭 12元/份', '酱油皇卤鸡腿饭 15元/份', '香辣鸭脯肉饭 13元/份', '蜜汁叉烧饭 18元/份', '牌味双拼饭 22元/份', '香辣鸭腿饭 14元/份'],
    3 : ['马来咖喱鸡饭 12元', '马来辣盘鸡饭 12元', '马来黑胡椒鸡饭 12元', '马来菠萝鸡饭 12元', '马来柠檬鱼片饭 15元', '马来香辣鱼片饭 15元'],
    4 : ['特色马来咖喱咖沙面 15元', '特色马来炒面 12元', '干炒河粉 12元', '干炒河粉（素） 10元', '香辣花甲米线 15元', '蒜香花甲米线 15元'],
    8 : ['酱爆茄汁焖锅 9元', '香酥藕盒焖锅 12元', '千页豆腐焖锅 9元', '小酥肉焖锅 13元', '火腿腐竹焖锅 10元', '爆汁鸡块焖锅13元', '风味香肠焖锅 12元', '鲜嫩里脊焖锅 13元', '招牌三鲜焖锅 12元', '雪花肥牛焖锅 14元'],
    7 : ['猪肉大葱 14元 12元', '韭菜大肉 14元 12元', '韭菜鸡蛋 13元 11元', '蓬菜大肉 14元 12元', '萝卜大肉 14元 12元', '菌香大肉 14元 12元'],
    9 : ['红油小面 8元 7.5元', '晚杂小面 9.5元 5元', '牛肉小面 12元 11元', '肥牛小面 15元 11元', '肉臊子小面 10元 9.5元', '香辣鸡块小面 10元 9.5元', '酸菜肉丝小面 10元 9.5元', '培根小面 12元 11元', '骨汤三鲜面 8.5元 8元', '骨汤配牛面 12元 11元', '骨汤牛肉面：12元 11元', '骨汤虾丸面 10元 9元'],
    10 : ['香辣脆皮炸鸡饭 12元 11元'],
    11 : ['秘制猪脚饭：15元/份', '香辣排骨饭：15元/份'],
    12 : ['冒菜, 香锅']
}

if __name__ == '__main__':
    str = ""
    with open('test.txt', encoding='utf-8') as file:
        content = file.read()
        content = content.rstrip() ##rstrip()删除字符串末尾的空行
        arr = content.split("\n")
        print(arr)